spec/fixtures/PxFusion_Transaction/_generate_session_id_/.yml

---
http_interactions:
- request:
    method: post
    uri: https://sec.paymentexpress.com/PxF/pxf.svc
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://paymentexpress.com"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:GetTransactionId><tns:username><USERNAME></tns:username><tns:password><PASSWORD></tns:password><tns:tranDetail><tns:amount>10.00</tns:amount><tns:currency>NZD</tns:currency><tns:returnUrl>https://test.host/</tns:returnUrl><tns:txnRef>1375927420</tns:txnRef><tns:txnType>Purchase</tns:txnType></tns:tranDetail></tns:GetTransactionId></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"http://paymentexpress.com/IPxFusion/GetTransactionId"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '676'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - DPS_PX_SERVER
      Cache-Control:
      - private
      Content-Type:
      - text/xml; charset=utf-8
      Vary:
      - Accept-Encoding
      Date:
      - Thu, 08 Aug 2013 02:03:38 GMT
      Content-Length:
      - '360'
    body:
      encoding: UTF-8
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetTransactionIdResponse
        xmlns="http://paymentexpress.com"><GetTransactionIdResult xmlns:a="http://schemas.datacontract.org/2004/07/"
        xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:sessionId>00000100167684456d1970b4a6f5c501</a:sessionId><a:success>true</a:success><a:transactionId>00000100167684456d1970b4a6f5c501</a:transactionId></GetTransactionIdResult></GetTransactionIdResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Thu, 08 Aug 2013 02:03:41 GMT
recorded_with: VCR 2.5.0
