spec/fixtures/PxFusion_Transaction/_fetch/transaction_is_incomplete/.yml

---
http_interactions:
- request:
    method: post
    uri: https://sec.paymentexpress.com/PxF/pxf.svc
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://paymentexpress.com"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:GetTransactionId><tns:username><USERNAME></tns:username><tns:password><PASSWORD></tns:password><tns:tranDetail><tns:amount>10.00</tns:amount><tns:currency>NZD</tns:currency><tns:returnUrl>http://pxfusion.local/test</tns:returnUrl><tns:txnRef>1375327887</tns:txnRef><tns:txnType>Purchase</tns:txnType></tns:tranDetail></tns:GetTransactionId></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"http://paymentexpress.com/IPxFusion/GetTransactionId"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '684'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - DPS_PX_SERVER
      Cache-Control:
      - private
      Content-Type:
      - text/xml; charset=utf-8
      Vary:
      - Accept-Encoding
      Date:
      - Thu, 01 Aug 2013 03:31:22 GMT
      Content-Length:
      - '360'
    body:
      encoding: UTF-8
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetTransactionIdResponse
        xmlns="http://paymentexpress.com"><GetTransactionIdResult xmlns:a="http://schemas.datacontract.org/2004/07/"
        xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:sessionId>0000010016330585a06370cd424efc01</a:sessionId><a:success>true</a:success><a:transactionId>0000010016330585a06370cd424efc01</a:transactionId></GetTransactionIdResult></GetTransactionIdResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Thu, 01 Aug 2013 03:31:27 GMT
- request:
    method: post
    uri: https://sec.paymentexpress.com/PxF/pxf.svc
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://paymentexpress.com"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:GetTransaction><tns:username><USERNAME></tns:username><tns:password><PASSWORD></tns:password><tns:transactionId>0000010016330585a06370cd424efc01</tns:transactionId></tns:GetTransaction></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"http://paymentexpress.com/IPxFusion/GetTransaction"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '529'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - DPS_PX_SERVER
      Cache-Control:
      - private
      Content-Type:
      - text/xml; charset=utf-8
      Vary:
      - Accept-Encoding
      Date:
      - Thu, 01 Aug 2013 03:31:23 GMT
      Content-Length:
      - '591'
    body:
      encoding: UTF-8
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetTransactionResponse
        xmlns="http://paymentexpress.com"><GetTransactionResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><amount/><authCode/><billingId/><cardHolderName/><cardName/><cardNumber/><cardNumber2/><currencyId/><currencyName/><currencyRate
        i:nil="true"/><cvc2ResultCode/><dateExpiry/><dateSettlement>0001-01-01T00:00:00</dateSettlement><dpsBillingId/><dpsTxnRef/><merchantReference/><responseCode/><responseText/><riskRuleMatches
        xmlns:a="http://schemas.datacontract.org/2004/07/"/><sessionId>0000010016330585a06370cd424efc01</sessionId><status>6</status><testMode>false</testMode><transactionId>0000010016330585a06370cd424efc01</transactionId><transactionResultFields
        xmlns:a="http://schemas.datacontract.org/2004/07/"/><txnData1/><txnData2/><txnData3/><txnMac/><txnRef/><txnType/></GetTransactionResult></GetTransactionResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Thu, 01 Aug 2013 03:31:27 GMT
recorded_with: VCR 2.5.0
