spec/fixtures/PxFusion_Transaction/_fetch/transaction_does_not_exist/1_3_3_1.yml

---
http_interactions:
- request:
    method: post
    uri: https://sec.paymentexpress.com/PxF/pxf.svc
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://paymentexpress.com"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:GetTransaction><tns:username><USERNAME></tns:username><tns:password><PASSWORD></tns:password><tns:transactionId>1234</tns:transactionId></tns:GetTransaction></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"http://paymentexpress.com/IPxFusion/GetTransaction"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '501'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Length:
      - '889'
      Content-Type:
      - text/xml; charset=utf-8
      Server:
      - ''
      X-Aspnet-Version:
      - ''
      X-Powered-By:
      - ''
      Date:
      - Tue, 31 May 2016 01:10:21 GMT
    body:
      encoding: UTF-8
      string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetTransactionResponse
        xmlns="http://paymentexpress.com"><GetTransactionResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><amount/><authCode/><billingId/><cardHolderName/><cardName/><cardNumber/><cardNumber2/><currencyId/><currencyName/><currencyRate
        i:nil="true"/><cvc2ResultCode/><dateExpiry/><dateSettlement>0001-01-01T00:00:00</dateSettlement><dpsBillingId/><dpsTxnRef/><merchantReference/><responseCode/><responseText/><riskRuleMatches
        xmlns:a="http://schemas.datacontract.org/2004/07/"/><sessionId>1234</sessionId><status>6</status><testMode>false</testMode><transactionId>1234</transactionId><transactionResultFields
        xmlns:a="http://schemas.datacontract.org/2004/07/"/><txnData1/><txnData2/><txnData3/><txnMac/><txnRef/><txnType/></GetTransactionResult></GetTransactionResponse></s:Body></s:Envelope>
    http_version: 
  recorded_at: Tue, 31 May 2016 01:10:21 GMT
recorded_with: VCR 3.0.3
